---
layout: default
title: Wsp&#x00F3;&#x0142;pracuj z nami
l10n-link: contribute
l10n-lang: pl
---

<div class="row">
    <div class="col-md-12">
        <div class="jumbotron">
            <h1>Potrzebujemy Ciebie!</h1>
            <p class="lead">
                Ka&#380;dy mo&#380;e wnie&#347;&#263; sw&#243;j wk&#322;ad w Slim Framework. Ten projekt jest
                open source i jest ulepszony pod ka&#380;dym mo&#380;liwym wzgl&#281;dem dzi&#281;ki wsp&#243;&#322;pracownikom takim jak Ty.
            </p>
            <a class="btn btn-primary btn-lg" href="https://github.com/slimphp/Slim" target="_blank">Zobacz kod &#378;r&#243;d&#322;owy</a>
        </div>

        <div class="alert alert-info">
            <strong><i class="fa fa-lock"></i> Zg&#322;aszanie problem&#243;w z bezpiecze&#324;stwem</strong>
            <p>
                Je&#347;li uwa&#380;asz, że znalaz&#322;e&#347; problem dotycz&#261;cy bezpiecze&#324;stwa w Slim Framework, nie u&#380;ywaj
                "forum wsparcia" lub narzędzia do śledzenia problemów i nie publikuj problemu publicznie.
                Zamiast tego wyślij wiadomosc e-mail z opisem problemu na adres <strong>security [at] slimframework.com</strong>.
            </p>
        </div>

        <h2>Jak mo&#380;esz pom&#243;c?</h2>
        <p>
            Zawsze jest co&#347;, co wymaga naprawy lub poprawy. Mo&#380;esz znale&#378;&#263; list&#281;
            zaleg&#322;ych zada&#324; na stronie <a href="https://github.com/slimphp/Slim/issues">GitHub Issue Tracker</a>.
            Przejrzyj otwarte problemy i rozpocznij dyskusj&#281; na temat odpowiednich w&#261;tk&#243;w, je&#347;li chcesz pom&#243;c.
        </p>
        <p>
            Je&#347;li nie wiesz, jak pisa&#263; kod, nie martw się! Mo&#380;esz pom&#243;c ulepszy&#263; dokumentacj&#281;. Mo&#380;esz
            nawet poprawi&#263; liter&#243;wki. Nie my&#347;l, &#380;e musisz by&#263; genialnym programist&#261;, aby pom&#243;c. Cokolwiek zrobisz,
            b&#281;dzie bardzo mile widziane!
        </p>

        <h2>Wytyczne dla wsp&#243;&#322;pracownik&#243;w</h2>
        <p>
            Wszyscy programi&#347;ci r&#243;zni&#261; sie od siebie i dlatego projekt Slim Framework
            ma wytyczne dla wsp&#243;&#322;pracownik&#243;w. Wytyczne zapewniaj&#261; to, &#380;e wszyscy wsp&#243;&#322;tw&#243;rcy postępuj&#261; tak samo
            regu&#322;y i ten sam styl kodu.
        </p>
        <ol>
            <li>Pisz kod kompatybilny ze standardem <a href="https://github.com/php-fig/fig-standards/blob/master/accepted/PSR-2-coding-style-guide.md">PSR-2</a></li>
            <li>U&#380;ywaj znak&#243;w przej&#347;cia do nowej linii w stylu UNIX`a</li>
            <li>Usu&#324; ko&#324;cowe bia&#322;e spacje</li>
            <li>U&#380;yj czterech spacji zamiast tabulacji</li>
        </ol>

        <h2>&#379;&#261;danie Pull</h2>
        <p>
            Oddziel ka&#380;d&#261; now&#261; funkcj&#281; lub ulepszenie do osobnej ga&#322;&#281;zi w rozwidlonym repozytorium.
            Wy&#347;lij &#380;&#261;danie &#347;ci&#261;gni&#281;cia z ka&#380;dej ga&#322;&#281;zi funkcji do repozytorium Slim Framework ga&#322;&#281;zi <code> develop </code>.
            Wszystkie zmiany powinny obejmowa&#263; odpowiednie testy PHPUnit.
        </p>
    </div>
</div>
